MikroElektronika/core_packages/RX/gcc/def/renesas/R5F526TAADFL/mcu.h
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char B0 : 1;
			unsigned char B1 : 1;
			unsigned char B2 : 1;
			unsigned char B3 : 1;
			unsigned char B4 : 1;
			unsigned char B5 : 1;
			unsigned char B6 : 1;
			unsigned char B7 : 1;
#else
			unsigned char B7 : 1;
			unsigned char B6 : 1;
			unsigned char B5 : 1;
			unsigned char B4 : 1;
			unsigned char B3 : 1;
			unsigned char B2 : 1;
			unsigned char B1 : 1;
			unsigned char B0 : 1;
#endif
	} BIT;
	} DSCR;
	char           wk6[71];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char  : 3;
			unsigned char B3 : 1;
			unsigned char  : 4;
#else
			unsigned char  : 4;
			unsigned char B3 : 1;
			unsigned char  : 3;
#endif
	} BIT;
	} DSCR2;
} st_portd_t;

typedef struct st_porte {
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char B0 : 1;
			unsigned char B1 : 1;
			unsigned char  : 1;
			unsigned char B3 : 1;
			unsigned char B4 : 1;
			unsigned char B5 : 1;
			unsigned char  : 2;
#else
			unsigned char  : 2;
			unsigned char B5 : 1;
			unsigned char B4 : 1;
			unsigned char B3 : 1;
			unsigned char  : 1;
			unsigned char B1 : 1;
			unsigned char B0 : 1;
#endif
	} BIT;
	} PDR;
	char           wk0[31];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char B0 : 1;
			unsigned char B1 : 1;
			unsigned char  : 1;
			unsigned char B3 : 1;
			unsigned char B4 : 1;
			unsigned char B5 : 1;
			unsigned char  : 2;
#else
			unsigned char  : 2;
			unsigned char B5 : 1;
			unsigned char B4 : 1;
			unsigned char B3 : 1;
			unsigned char  : 1;
			unsigned char B1 : 1;
			unsigned char B0 : 1;
#endif
	} BIT;
	} PODR;
	char           wk1[31];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char B0 : 1;
			unsigned char B1 : 1;
			unsigned char B2 : 1;
			unsigned char B3 : 1;
			unsigned char B4 : 1;
			unsigned char B5 : 1;
			unsigned char  : 2;
#else
			unsigned char  : 2;
			unsigned char B5 : 1;
			unsigned char B4 : 1;
			unsigned char B3 : 1;
			unsigned char B2 : 1;
			unsigned char B1 : 1;
			unsigned char B0 : 1;
#endif
	} BIT;
	} PIDR;
	char           wk2[31];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char B0 : 1;
			unsigned char B1 : 1;
			unsigned char B2 : 1;
			unsigned char B3 : 1;
			unsigned char B4 : 1;
			unsigned char B5 : 1;
			unsigned char  : 2;
#else
			unsigned char  : 2;
			unsigned char B5 : 1;
			unsigned char B4 : 1;
			unsigned char B3 : 1;
			unsigned char B2 : 1;
			unsigned char B1 : 1;
			unsigned char B0 : 1;
#endif
	} BIT;
	} PMR;
	char           wk3[45];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char B0 : 1;
			unsigned char  : 1;
			unsigned char B2 : 1;
			unsigned char  : 3;
			unsigned char B6 : 1;
			unsigned char  : 1;
#else
			unsigned char  : 1;
			unsigned char B6 : 1;
			unsigned char  : 3;
			unsigned char B2 : 1;
			unsigned char  : 1;
			unsigned char B0 : 1;
#endif
	} BIT;
	} ODR0;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char B0 : 1;
			unsigned char  : 1;
			unsigned char B2 : 1;
			unsigned char  : 5;
#else
			unsigned char  : 5;
			unsigned char B2 : 1;
			unsigned char  : 1;
			unsigned char B0 : 1;
#endif
	} BIT;
	} ODR1;
	char           wk4[48];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char B0 : 1;
			unsigned char B1 : 1;
			unsigned char  : 1;
			unsigned char B3 : 1;
			unsigned char B4 : 1;
			unsigned char B5 : 1;
			unsigned char  : 2;
#else
			unsigned char  : 2;
			unsigned char B5 : 1;
			unsigned char B4 : 1;
			unsigned char B3 : 1;
			unsigned char  : 1;
			unsigned char B1 : 1;
			unsigned char B0 : 1;
#endif
	} BIT;
	} PCR;
	char           wk5[31];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char B0 : 1;
			unsigned char B1 : 1;
			unsigned char  : 1;
			unsigned char B3 : 1;
			unsigned char B4 : 1;
			unsigned char B5 : 1;
			unsigned char  : 2;
#else
			unsigned char  : 2;
			unsigned char B5 : 1;
			unsigned char B4 : 1;
			unsigned char B3 : 1;
			unsigned char  : 1;
			unsigned char B1 : 1;
			unsigned char B0 : 1;
#endif
	} BIT;
	} DSCR;
} st_porte_t;

typedef struct st_portn {
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char  : 6;
			unsigned char B6 : 1;
			unsigned char B7 : 1;
#else
			unsigned char B7 : 1;
			unsigned char B6 : 1;
			unsigned char  : 6;
#endif
	} BIT;
	} PDR;
	char           wk0[31];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char  : 6;
			unsigned char B6 : 1;
			unsigned char B7 : 1;
#else
			unsigned char B7 : 1;
			unsigned char B6 : 1;
			unsigned char  : 6;
#endif
	} BIT;
	} PODR;
	char           wk1[31];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char  : 6;
			unsigned char B6 : 1;
			unsigned char B7 : 1;
#else
			unsigned char B7 : 1;
			unsigned char B6 : 1;
			unsigned char  : 6;
#endif
	} BIT;
	} PIDR;
	char           wk2[31];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char  : 6;
			unsigned char B6 : 1;
			unsigned char B7 : 1;
#else
			unsigned char B7 : 1;
			unsigned char B6 : 1;
			unsigned char  : 6;
#endif
	} BIT;
	} PMR;
	char           wk3[54];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char  : 4;
			unsigned char B4 : 1;
			unsigned char  : 1;
			unsigned char B6 : 1;
			unsigned char  : 1;
#else
			unsigned char  : 1;
			unsigned char B6 : 1;
			unsigned char  : 1;
			unsigned char B4 : 1;
			unsigned char  : 4;
#endif
	} BIT;
	} ODR1;
	char           wk4[40];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char  : 6;
			unsigned char B6 : 1;
			unsigned char B7 : 1;
#else
			unsigned char B7 : 1;
			unsigned char B6 : 1;
			unsigned char  : 6;
#endif
	} BIT;
	} PCR;
	char           wk5[31];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char  : 6;
			unsigned char B6 : 1;
			unsigned char B7 : 1;
#else
			unsigned char B7 : 1;
			unsigned char B6 : 1;
			unsigned char  : 6;
#endif
	} BIT;
	} DSCR;
} st_portn_t;

typedef struct st_ram {
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char RAMMODE : 2;
			unsigned char  : 6;
#else
			unsigned char  : 6;
			unsigned char RAMMODE : 2;
#endif
	} BIT;
	} RAMMODE;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char RAMERR : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char RAMERR : 1;
#endif
	} BIT;
	} RAMSTS;
	char           wk0[2];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char RAMPRCR : 1;
			unsigned char KW : 7;
#else
			unsigned char KW : 7;
			unsigned char RAMPRCR : 1;
#endif
	} BIT;
	} RAMPRCR;
	char           wk1[3];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long  : 3;
			unsigned long READ : 16;
			unsigned long  : 13;
#else
			unsigned long  : 13;
			unsigned long READ : 16;
			unsigned long  : 3;
#endif
	} BIT;
	} RAMECAD;
} st_ram_t;

typedef struct st_ri3c {
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long OMS : 1;
			unsigned long  : 31;
#else
			unsigned long  : 31;
			unsigned long OMS : 1;
#endif
	} BIT;
	} ICMR;
	char           wk0[16];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long IBAINC : 1;
			unsigned long  : 7;
			unsigned long HJC : 1;
			unsigned long  : 20;
			unsigned long ABORT : 1;
			unsigned long RESUME : 1;
			unsigned long ICE : 1;
#else
			unsigned long ICE : 1;
			unsigned long RESUME : 1;
			unsigned long ABORT : 1;
			unsigned long  : 20;
			unsigned long HJC : 1;
			unsigned long  : 7;
			unsigned long IBAINC : 1;
#endif
	} BIT;
	} ICCR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long  : 16;
			unsigned long DADR : 7;
			unsigned long  : 8;
			unsigned long DAV : 1;
#else
			unsigned long DAV : 1;
			unsigned long  : 8;
			unsigned long DADR : 7;
			unsigned long  : 16;
#endif
	} BIT;
	} ICCAR;
	char           wk1[4];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long MRST : 1;
			unsigned long CQRST : 1;
			unsigned long RQRST : 1;
			unsigned long TBRST : 1;
			unsigned long RBRST : 1;
			unsigned long IQRST : 1;
			unsigned long SQRST : 1;
			unsigned long  : 9;
			unsigned long ISRST : 1;
			unsigned long  : 15;
#else
			unsigned long  : 15;
			unsigned long ISRST : 1;
			unsigned long  : 9;
			unsigned long SQRST : 1;
			unsigned long IQRST : 1;
			unsigned long RBRST : 1;
			unsigned long TBRST : 1;
			unsigned long RQRST : 1;
			unsigned long CQRST : 1;
			unsigned long MRST : 1;
#endif
	} BIT;
	} ICRCR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long  : 2;
			unsigned long ACF : 1;
			unsigned long  : 4;
			unsigned long WP : 1;
			unsigned long  : 24;
#else
			unsigned long  : 24;
			unsigned long WP : 1;
			unsigned long  : 4;
			unsigned long ACF : 1;
			unsigned long  : 2;
#endif
	} BIT;
	} ICMMR;
	char           wk2[8];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long  : 10;
			unsigned long BERF : 1;
			unsigned long  : 21;
#else
			unsigned long  : 21;
			unsigned long BERF : 1;
			unsigned long  : 10;
#endif
	} BIT;
	} ICISR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long  : 10;
			unsigned long BERDE : 1;
			unsigned long  : 21;
#else
			unsigned long  : 21;
			unsigned long BERDE : 1;
			unsigned long  : 10;
#endif
	} BIT;
	} ICISER;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long  : 10;
			unsigned long BERIE : 1;
			unsigned long  : 21;
#else
			unsigned long  : 21;
			unsigned long BERIE : 1;
			unsigned long  : 10;
#endif
	} BIT;
	} ICISIER;
	char           wk3[8];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long  : 19;
			unsigned long INDEX : 5;
			unsigned long  : 8;
#else
			unsigned long  : 8;
			unsigned long INDEX : 5;
			unsigned long  : 19;
#endif
	} BIT;
	} ICDCTIR;
	char           wk4[16];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long RHJRN : 1;
			unsigned long RCRRN : 1;
			unsigned long  : 1;
			unsigned long RTIRN : 1;
			unsigned long  : 28;
#else
			unsigned long  : 28;
			unsigned long RTIRN : 1;
			unsigned long  : 1;
			unsigned long RCRRN : 1;
			unsigned long RHJRN : 1;
#endif
	} BIT;
	} ICINCR;
	char           wk5[8];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long  : 16;
			unsigned long TA0DE : 1;
			unsigned long  : 15;
#else
			unsigned long  : 15;
			unsigned long TA0DE : 1;
			unsigned long  : 16;
#endif
	} BIT;
	} ICTCR;
	char           wk6[12];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ODLW : 8;
			unsigned long ODHW : 8;
			unsigned long PPLW : 6;
			unsigned long  : 2;
			unsigned long PPHW : 6;
			unsigned long  : 1;
			unsigned long ODDBL : 1;
#else
			unsigned long ODDBL : 1;
			unsigned long  : 1;
			unsigned long PPHW : 6;
			unsigned long  : 2;
			unsigned long PPLW : 6;
			unsigned long ODHW : 8;
			unsigned long ODLW : 8;
#endif
	} BIT;
	} ICSBR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ODLW : 8;
			unsigned long ODHW : 8;
			unsigned long PPLW : 6;
			unsigned long  : 2;
			unsigned long PPHW : 6;
			unsigned long  : 2;
#else
			unsigned long  : 2;
			unsigned long PPHW : 6;
			unsigned long  : 2;
			unsigned long PPLW : 6;
			unsigned long ODHW : 8;
			unsigned long ODLW : 8;
#endif
	} BIT;
	} ICEBR;
	unsigned long  ICBFTR;
	unsigned long  ICBATR;
	unsigned long  ICBITR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long SDAO : 1;
			unsigned long SCLO : 1;
			unsigned long SOWP : 1;
			unsigned long  : 29;
#else
			unsigned long  : 29;
			unsigned long SOWP : 1;
			unsigned long SCLO : 1;
			unsigned long SDAO : 1;
#endif
	} BIT;
	} ICOCR;
	char           wk7[4];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TMOS : 2;
			unsigned long  : 2;
			unsigned long TMOL : 1;
			unsigned long TMOH : 1;
			unsigned long TMOM : 2;
			unsigned long  : 24;
#else
			unsigned long  : 24;
			unsigned long TMOM : 2;
			unsigned long TMOH : 1;
			unsigned long TMOL : 1;
			unsigned long  : 2;
			unsigned long TMOS : 2;
#endif
	} BIT;
	} ICTOR;
	char           wk8[28];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long STT : 16;
			unsigned long  : 12;
			unsigned long AASE : 1;
			unsigned long  : 1;
			unsigned long PBSE : 1;
			unsigned long APSE : 1;
#else
			unsigned long APSE : 1;
			unsigned long PBSE : 1;
			unsigned long  : 1;
			unsigned long AASE : 1;
			unsigned long  : 12;
			unsigned long STT : 16;
#endif
	} BIT;
	} ICSTCR;
	char           wk9[12];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long  : 16;
			unsigned long DLGTH : 16;
#else
			unsigned long DLGTH : 16;
			unsigned long  : 16;
#endif
	} BIT;
	} ICTDLR;
	char           wk10[140];
	unsigned long  ICCQR;
	unsigned long  ICRQR;
	union {
		unsigned long LONG;
		unsigned char BYTE;
	} ICDR;
	char           wk11[32];
	unsigned long  ICIQR;
	unsigned long  ICSQR;
	char           wk12[12];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CQTH : 8;
			unsigned long RQTH : 8;
			unsigned long IDSS : 8;
			unsigned long IQTH : 8;
#else
			unsigned long IQTH : 8;
			unsigned long IDSS : 8;
			unsigned long RQTH : 8;
			unsigned long CQTH : 8;
#endif
	} BIT;
	} ICQBTCR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TETH : 3;
			unsigned long  : 5;
			unsigned long RFTH : 3;
			unsigned long  : 5;
			unsigned long TSTH : 3;
			unsigned long  : 5;
			unsigned long RSTH : 3;
			unsigned long  : 5;
#else
			unsigned long  : 5;
			unsigned long RSTH : 3;
			unsigned long  : 5;
			unsigned long TSTH : 3;
			unsigned long  : 5;
			unsigned long RFTH : 3;
			unsigned long  : 5;
			unsigned long TETH : 3;
#endif
	} BIT;
	} ICDBTCR;
	char           wk13[40];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long SQTH : 8;
			unsigned long  : 24;
#else
			unsigned long  : 24;
			unsigned long SQTH : 8;
#endif
	} BIT;
	} ICSQTCR;
	char           wk14[12];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long START : 1;
			unsigned long STOP : 1;
			unsigned long HDRXDF : 1;
			unsigned long  : 17;
			unsigned long TMOF : 1;
			unsigned long  : 11;
#else
			unsigned long  : 11;
			unsigned long TMOF : 1;
			unsigned long  : 17;
			unsigned long HDRXDF : 1;
			unsigned long STOP : 1;
			unsigned long START : 1;
#endif
	} BIT;
	} ICSR2;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long STDE : 1;
			unsigned long SPDE : 1;
			unsigned long HDRXDE : 1;
			unsigned long  : 17;
			unsigned long TMOE : 1;
			unsigned long  : 11;
#else
			unsigned long  : 11;
			unsigned long TMOE : 1;
			unsigned long  : 17;
			unsigned long HDRXDE : 1;
			unsigned long SPDE : 1;
			unsigned long STDE : 1;
#endif
	} BIT;
	} ICSER;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long STIE : 1;
			unsigned long SPIE : 1;
			unsigned long HDRXIE : 1;
			unsigned long  : 17;
			unsigned long TMOIE : 1;
			unsigned long  : 11;
#else
			unsigned long  : 11;
			unsigned long TMOIE : 1;
			unsigned long  : 17;
			unsigned long HDRXIE : 1;
			unsigned long SPIE : 1;
			unsigned long STIE : 1;
#endif
	} BIT;
	} ICSIER;
	char           wk15[4];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TDRE : 1;
			unsigned long RDRF : 1;
			unsigned long IQEFF : 1;
			unsigned long CQEF : 1;
			unsigned long RQFF : 1;
			unsigned long DTAF : 1;
			unsigned long  : 3;
			unsigned long DTEF : 1;
			unsigned long  : 10;
			unsigned long SQFF : 1;
			unsigned long  : 11;
#else
			unsigned long  : 11;
			unsigned long SQFF : 1;
			unsigned long  : 10;
			unsigned long DTEF : 1;
			unsigned long  : 3;
			unsigned long DTAF : 1;
			unsigned long RQFF : 1;
			unsigned long CQEF : 1;
			unsigned long IQEFF : 1;
			unsigned long RDRF : 1;
			unsigned long TDRE : 1;
#endif
	} BIT;
	} ICCSR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TDE : 1;
			unsigned long RDE : 1;
			unsigned long IQEFDE : 1;
			unsigned long CQEDE : 1;
			unsigned long RQFDE : 1;
			unsigned long DTADE : 1;
			unsigned long  : 3;
			unsigned long DTEDE : 1;
			unsigned long  : 10;
			unsigned long SQFDE : 1;
			unsigned long  : 11;
#else
			unsigned long  : 11;
			unsigned long SQFDE : 1;
			unsigned long  : 10;
			unsigned long DTEDE : 1;
			unsigned long  : 3;
			unsigned long DTADE : 1;
			unsigned long RQFDE : 1;
			unsigned long CQEDE : 1;
			unsigned long IQEFDE : 1;
			unsigned long RDE : 1;
			unsigned long TDE : 1;
#endif
	} BIT;
	} ICCSER;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TIE : 1;
			unsigned long RIE : 1;
			unsigned long IQEFIE : 1;
			unsigned long CQEIE : 1;
			unsigned long RQFIE : 1;
			unsigned long DTAIE : 1;
			unsigned long  : 3;
			unsigned long DTEIE : 1;
			unsigned long  : 10;
			unsigned long SQFIE : 1;
			unsigned long  : 11;
#else
			unsigned long  : 11;
			unsigned long SQFIE : 1;
			unsigned long  : 10;
			unsigned long DTEIE : 1;
			unsigned long  : 3;
			unsigned long DTAIE : 1;
			unsigned long RQFIE : 1;
			unsigned long CQEIE : 1;
			unsigned long IQEFIE : 1;
			unsigned long RIE : 1;
			unsigned long TIE : 1;
#endif
	} BIT;
	} ICCSIER;
	char           wk16[36];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long BFREE : 1;
			unsigned long BAVL : 1;
			unsigned long BIDL : 1;
			unsigned long  : 29;
#else
			unsigned long  : 29;
			unsigned long BIDL : 1;
			unsigned long BAVL : 1;
			unsigned long BFREE : 1;
#endif
	} BIT;
	} ICBSR;
	char           wk17[16];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long SADR : 7;
			unsigned long  : 5;
			unsigned long IBIPL : 1;
			unsigned long TIRRJ : 1;
			unsigned long CRRRJ : 1;
			unsigned long IBITSE : 1;
			unsigned long DADR : 8;
			unsigned long  : 5;
			unsigned long NACKRC : 2;
			unsigned long TYPE : 1;
#else
			unsigned long TYPE : 1;
			unsigned long NACKRC : 2;
			unsigned long  : 5;
			unsigned long DADR : 8;
			unsigned long IBITSE : 1;
			unsigned long CRRRJ : 1;
			unsigned long TIRRJ : 1;
			unsigned long IBIPL : 1;
			unsigned long  : 5;
			unsigned long SADR : 7;
#endif
	} BIT;
	} ICTDATR0;
	char           wk18[4];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long SADR : 7;
			unsigned long  : 5;
			unsigned long IBIPL : 1;
			unsigned long TIRRJ : 1;
			unsigned long CRRRJ : 1;
			unsigned long IBITSE : 1;
			unsigned long DADR : 8;
			unsigned long  : 5;
			unsigned long NACKRC : 2;
			unsigned long TYPE : 1;
#else
			unsigned long TYPE : 1;
			unsigned long NACKRC : 2;
			unsigned long  : 5;
			unsigned long DADR : 8;
			unsigned long IBITSE : 1;
			unsigned long CRRRJ : 1;
			unsigned long TIRRJ : 1;
			unsigned long IBIPL : 1;
			unsigned long  : 5;
			unsigned long SADR : 7;
#endif
	} BIT;
	} ICTDATR1;
	char           wk19[4];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long SADR : 7;
			unsigned long  : 5;
			unsigned long IBIPL : 1;
			unsigned long TIRRJ : 1;
			unsigned long CRRRJ : 1;
			unsigned long IBITSE : 1;
			unsigned long DADR : 8;
			unsigned long  : 5;
			unsigned long NACKRC : 2;
			unsigned long TYPE : 1;
#else
			unsigned long TYPE : 1;
			unsigned long NACKRC : 2;
			unsigned long  : 5;
			unsigned long DADR : 8;
			unsigned long IBITSE : 1;
			unsigned long CRRRJ : 1;
			unsigned long TIRRJ : 1;
			unsigned long IBIPL : 1;
			unsigned long  : 5;
			unsigned long SADR : 7;
#endif
	} BIT;
	} ICTDATR2;
	char           wk20[4];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long SADR : 7;
			unsigned long  : 5;
			unsigned long IBIPL : 1;
			unsigned long TIRRJ : 1;
			unsigned long CRRRJ : 1;
			unsigned long IBITSE : 1;
			unsigned long DADR : 8;
			unsigned long  : 5;
			unsigned long NACKRC : 2;
			unsigned long TYPE : 1;
#else
			unsigned long TYPE : 1;
			unsigned long NACKRC : 2;
			unsigned long  : 5;
			unsigned long DADR : 8;
			unsigned long IBITSE : 1;
			unsigned long CRRRJ : 1;
			unsigned long TIRRJ : 1;
			unsigned long IBIPL : 1;
			unsigned long  : 5;
			unsigned long SADR : 7;
#endif
	} BIT;
	} ICTDATR3;
	char           wk21[96];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long SADR : 7;
			unsigned long  : 9;
			unsigned long DADR : 8;
			unsigned long  : 5;
			unsigned long NACKRC : 2;
			unsigned long TYPE : 1;
#else
			unsigned long TYPE : 1;
			unsigned long NACKRC : 2;
			unsigned long  : 5;
			unsigned long DADR : 8;
			unsigned long  : 9;
			unsigned long SADR : 7;
#endif
	} BIT;
	} ICEDATR;
	char           wk22[12];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long SADR : 10;
			unsigned long  : 2;
			unsigned long IBIPL : 1;
			unsigned long  : 3;
			unsigned long DADR : 7;
			unsigned long  : 9;
#else
			unsigned long  : 9;
			unsigned long DADR : 7;
			unsigned long  : 3;
			unsigned long IBIPL : 1;
			unsigned long  : 2;
			unsigned long SADR : 10;
#endif
	} BIT;
	} ICDAR0;
	char           wk23[28];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long  : 8;
			unsigned long LIMIT : 1;
			unsigned long IBIRQC : 1;
			unsigned long IBIPL : 1;
			unsigned long OFLC : 1;
			unsigned long  : 2;
			unsigned long ROLE : 2;
			unsigned long  : 16;
#else
			unsigned long  : 16;
			unsigned long ROLE : 2;
			unsigned long  : 2;
			unsigned long OFLC : 1;
			unsigned long IBIPL : 1;
			unsigned long IBIRQC : 1;
			unsigned long LIMIT : 1;
			unsigned long  : 8;
#endif
	} BIT;
	} ICTDCTR0;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long  : 8;
			unsigned long LIMIT : 1;
			unsigned long IBIRQC : 1;
			unsigned long IBIPL : 1;
			unsigned long OFLC : 1;
			unsigned long  : 2;
			unsigned long ROLE : 2;
			unsigned long  : 16;
#else
			unsigned long  : 16;
			unsigned long ROLE : 2;
			unsigned long  : 2;
			unsigned long OFLC : 1;
			unsigned long IBIPL : 1;
			unsigned long IBIRQC : 1;
			unsigned long LIMIT : 1;
			unsigned long  : 8;
#endif
	} BIT;
	} ICTDCTR1;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long  : 8;
			unsigned long LIMIT : 1;
			unsigned long IBIRQC : 1;
			unsigned long IBIPL : 1;
			unsigned long OFLC : 1;
			unsigned long  : 2;
			unsigned long ROLE : 2;
			unsigned long  : 16;
#else
			unsigned long  : 16;
			unsigned long ROLE : 2;
			unsigned long  : 2;
			unsigned long OFLC : 1;
			unsigned long IBIPL : 1;
			unsigned long IBIRQC : 1;
			unsigned long LIMIT : 1;
			unsigned long  : 8;
#endif
	} BIT;
	} ICTDCTR2;
	union {
		unsigned long LONG;
		struct {
			
